
//初始地图
var maps = [
[//序章
[1,2,2,2,2,5,2,2,2,2,1],
[1,2,2,2,2,4,2,2,2,2,1],
[1,2,2,2,2,4,2,2,2,2,1],
[1,2,2,2,2,4,2,2,2,2,1],
[1,2,2,2,2,4,2,2,2,2,1],
[1,2,2,2,2,4,2,2,2,2,1],
[1,1,2,2,2,4,2,2,2,1,1],
[1,1,1,1,1,2004,1,1,1,1,1],
[3,1,3,1,4,1001,4,1,3,1,3],
[3,3,3,3,3,4,3,3,3,3,3],
[3,3,3,3,3,4,3,3,3,3,3],
],
[//一层
[5,4,2001,3001,3002,3001,4,4,4,4,4],
[1,1,1,1,1,1,1,1,1,1,4],
[2007,4,3004,2004,4,1,2007,2001,2007,1,4],
[2001,3004,2007,1,4,1,2007,2001,2007,1,4],
[1,2004,1,1,4,1,1,1,3003,1,4],
[2001,3005,4,1,4,2004,3007,3001,3006,1,4],
[2011,4,2002,1,4,1,1,1,1,1,4],
[1,2004,1,1,4,4,4,4,4,4,4],
[4,3005,4,1,1,2006,1,1,1,2004,1],
[2007,2008,2001,1,2003,4,4,1,2001,3008,2001],
[2007,2009,2001,1,4,6,4,1,2001,2001,2001]
],
[//二层
[6,1,4,3009,4,1,2011,2010,2001,2003,1],
[4,1,2010,1,2008,1,2011,2010,2001,2002,1],
[4,1,2001,1,2001,1,2011,2010,2001,3010,1],
[4,1,2001,1,2001,1,1,1,1,2004,1,],
[4,1,4,1,4,4,4,2004,4,4,1],
[4,1,2004,1,1,2004,1,1,2004,1,1],
[4,8,4,4,4,4,1,4,3010,4,1],
[4,1,2004,1,1,2005,1,7,1,7,1],
[4,1,2001,1,2008,2007,1,4,1,4,1],
[4,1,2001,1,2008,2007,1,4,1,4,1],
[5,1,2011,1,2008,2007,1,1008,1,1009,1]
],
[//第三层
[2012,3002,2001,1,1004,1005,1006,1,1,1,1],
[3002,2001,4,1,4,4,4,1,4,3006,4],
[2001,3004,4,1,1,2004,1,1,4,1,4],
[1,2004,1,1,4,3004,4,1,2001,1,3002],
[4,4,4,1,1,1,4,1,2001,1,3006],
[3001,1,4,3006,3002,3006,4,1,2001,1,3002],
[3001,1,1,1,1,1,4,4,4,1,4],
[4,4,4,4,4,1,1,2004,1,1,4],
[1,1,1,1,3006,1,3002,4,3002,1,4],
[1,4,4,4,4,1,2010,3006,2001,1,4],
[6,4,1,1,1,1,2011,2008,2001,1,5]
]
,
[//第四层
[4,3003,4,1,4,1007,4,1,4,3003,4],
[2004,1,2004,1,4,4,4,1,2004,1,2004],
[4,1,4,1,1,7,1,1,4,1,4],
[4,1,3004,1,3011,3012,3011,1,3004,1,4],
[3006,1,2007,1,2010,3011,2010,1,2007,1,3006],
[3006,1,2007,1,1,2006,1,1,2007,1,3006],
[3002,1,4,1,3008,3013,3008,1,4,1,3002],
[4,1,4,1,2011,3008,2011,1,4,1,4],
[4,1,4,1,1,2005,1,1,4,1,4],
[4,1,4,1,2001,4,2001,1,4,1,4],
[5,1,4,3003,4,4,4,3003,4,1,6]
],
[//第五层
[2013,1,2007,1,2008,3007,4,4,3007,2001,2002],
[4,1,2011,1,3007,4,4,4,4,3007,2001],
[3011,1,4,1,3005,4,1,1,2004,1,1],
[4,2004,3007,1,2014,3005,1,4,3008,3005,1003],
[3011,1,4,1,1,1,1,4,4,4,3005],
[2011,1,4,4,4,3006,3005,4,4,4,4],
[2010,1,1,3003,1,1,1,1,4,4,4],
[4,1002,1,3003,1,4,4,4,3008,3013,4],
[1,1,1,3006,1,2004,1,2005,1,2004,1],
[4,4,1,4,1,3006,1,2010,2004,4,1],
[6,4,3006,4,4,4,1,2001,1,5,1]
],
[//第六层
[2015,3014,1,2010,1,2001,3015,2016,1,2008,2008],
[3014,2001,1,2011,1,4,2001,3015,1,3016,2008],
[2001,3012,2005,4,2005,3012,4,2001,1,4,3016],
[4,4,1,3013,1,4,4,4,1,3017,4],
[1,1,1,2006,1,1,1,1,1,2004,1],
[4,4,3018,4,2001,2001,2001,4,3018,4,4],
[4,1,1,1,1,1,1,1,1,1,1],
[4,1,3011,2004,3011,4,4,4,4,4,1],
[4,1,2004,1,2004,1,1,1,1,2005,1],
[4,1,3011,1,4,4,1,1,4,4,1],
[4,4,4,1,5,4,2004,2004,4,6,1]
],
[//第七层
[5,4,4,4,4,4,4,4,1,1,1],
[1,1,4,3012,1,2005,1,3014,4,1,1],
[1,4,3012,2010,1,3019,1,2011,3014,4,1],
[4,4,1,1,1,7,1,1,1,4,4],
[4,4,2005,3019,7,2017,7,3019,2005,4,4],
[4,1,1,1,1,7,1,1,1,1,4],
[4,1,2007,2011,1,3019,1,2010,2007,1,4],
[4,1,2001,2007,1,2005,1,2007,2001,1,4],
[4,1,1,2002,2002,2008,2002,2002,1,1,4],
[4,4,1,1,1,2006,1,1,1,4,4],
[1,4,4,2004,6,4,4,2004,4,4,1]
],
[//第八层
[6,1,4,4,4,4,1,4,2001,3014,4],
[4,1,4,1,1,2004,1,2004,1,1,4],
[4,1,4,1,4,4,2005,4,4,1,2011],
[4,1,4,1,3020,1,1,1,3011,1,3003],
[3011,1,4,1,2007,1,5,4,4,1,3003],
[3012,1,2010,1,2007,1,1,1,1,1,4],
[3011,1,3003,1,4,4,4,1,4,3012,4],
[4,1,3003,1,1,1,3013,1,2004,1,1],
[4,1,4,3014,4,1,3014,1,4,4,4],
[4,1,1,1,2004,1,4,1,1,1,4],
[4,4,3020,4,4,1,4,3015,3019,3015,4]
],
[//第九层
[2018,2001,4,1,1,1,4,4,4,1,4],
[2001,4,3021,2004,4,4,4,1,4,2004,3014],
[1,2004,1,1,4,1,1,1,4,1,2001],
[4,4,4,1,4,1,4,4,4,1,2001],
[4,4,4,2006,4,1,6,1,4,1,2007],
[1,2005,1,1,4,1,1,1,4,1,1],
[2010,3017,2011,1,3020,1,5,1,4,1,2007],
[1,2004,1,1,4,4,4,2004,4,1,2001],
[3014,2007,3014,1,1,2005,1,1,4,1,2001],
[2002,3014,2007,1,3016,3020,3016,1,4,2004,3014],
[2019,2002,3014,2004,2008,3016,2008,1,4,1,4]
],
[//第十层
[4,1,1,2010,3021,1,3021,2011,1,1,4],
[4,4,1,1,2004,1,2004,1,1,4,3017],
[4,4,4,4,4,1,4,4,4,3017,2008],
[4,1,4,1,1,1,1,1,4,1,1],
[3011,1,4,4,2001,2001,2001,4,4,1,2001],
[3012,1,4,1,1,1,1,2004,1,1,2001],
[3011,1,4,7,4,6,1,4,2004,3012,4],
[4,1,1,1,1,1,1,2004,1,1,4],
[4,1,2007,2010,2011,1,4,3012,4,1,4,2001],
[4,1,2007,2010,2011,2006,3020,1,3020,1,2001],
[5,1,2007,2010,2011,1,2002,1,2002,1,2007]
],
[//第十一层
[2007,1,2001,1,2002,1,2003,1,2008,2020,2008],
[2007,1,2001,1,2002,1,2003,1,3022,3023,3022],
[2007,1,2001,1,2002,1,2003,1,4,3022,4],
[2004,1,2004,1,2004,1,2004,1,1,2005,1],
[4,4,4,4,4,1,4,4,4,4,4],
[2004,1,1,2005,1,1,1,2005,1,1,2004],
[2010,1,4,3022,2008,3024,2008,3024,4,1,2011],
[2010,1,3021,1,1,1,1,1,3021,1,2011],
[2010,1,3021,1,1004,1005,1006,1,3021,1,2011],
[1,1,2006,1,2007,4,2007,1,2006,1,1],
[6,4,4,4,4,4,4,4,4,4,5]
],
[//第十二层
[1003,2010,1,4,3010,3009,3010,4,1,2008,2021],
[2011,4,1,4,1,2004,1,4,1,4,2008],
[4,4,1,4,1,3009,1,4,1,4,4],
[4,3024,1,4,1,2001,1,4,1,3026,4],
[3024,3025,1,4,1,2001,1,4,1,3027,3026],
[1,2005,1,4,1,2007,1,4,1,2005,1],
[4,4,4,4,1,2007,1,4,4,4,4],
[1,1,1,4,1,1,1,4,1,1,1],
[2010,3024,2004,3022,3022,3023,3022,3022,2004,3024,2011],
[1,1,1,1,1,2005,1,1,1,1,1],
[5,4,4,4,4,4,4,4,4,4,6]
],
[//第十三层
[4,3024,4,4,4,4,4,1,4,3025,4],
[4,1,1,1,1,1,2004,1,4,1,4],
[4,1,4,4,3022,4,4,1,4,1,4],
[2008,1,2006,1,1,1,4,1,4,1,4],
[3010,1,4,4,3025,1,3022,1,2011,1,4],
[3009,1,4,3028,7,1,3023,1,2011,1,4],
[3010,1,3025,7,1002,1,3022,1,2011,1,2010],
[4,1,1,1,1,1,4,1,4,1,2010],
[4,3010,4,1,4,4,4,3025,4,1,2010],
[1,1,4,1,2008,1,1,1,1,1,4],
[6,4,4,2005,4,5,1,2022,3028,2004,4]
],
[//第十四层
[1,4,3026,2013,5,4,4,4,4,4,1],
[1,4,2008,1,1,1,1,1,2008,4,1],
[1,4,1,1,1,1,1,1,1,4,1],
[1,4,1,1,1,2023,1,1,1,4,1],
[1,4,1,1,1,7,1,1,1,4,1],
[1,4,2007,1,1,3025,1,1,2007,4,1],
[1,4,2,2,1,3028,1,2,2,4,1],
[1,4,2,2,1,3025,1,2,2,4,1],
[1,4,2,2,1,2005,1,2,2,4,1],
[1,3022,3023,3022,2005,4,2005,3022,3023,3022,1],
[1,1,1,1,1,6,1,1,1,1,1]
],
[//第十五层
[4,4,4,4,6,2,5,4,4,4,4],
[4,2,2,2,2,2,2,2,2,2,4],
[4,2,2,1,1,1,1,1,2,2,4],
[4,2,1,1,1008,1,1009,1,1,2,4],
[4,2,1,1,2010,1,2010,1,1,2,4],
[4,2,1,1,2011,1,2011,1,1,2,4],
[4,2,2,1,4,1,4,1,2,2,4],
[4,2,2,1,2004,1,2004,1,2,2,4],
[4,2,2,2,4,4,4,2,2,2,4],
[4,2,2,2,2,2006,2,2,2,2,4],
[4,4,4,4,4,4,4,4,4,4,4]
],
[//第十六层  TODO 此处的蓝色老头需要16分钟内触发，并且没有将十字架给仙女
[2,2,2,2,2,4,6,2,2,2,2],
[2,2,2,2,2,4,2,2,2,2,2],
[2,2,2,2,2,4,2,2,2,2,2],
[2,2,2,2,1,2006,1,2,2,2,2],
[2,2,2,1,1008,4,1,1,2,2,2],
[2,2,2,1,1,1010,1,1,2,2,2],
[2,2,2,1,1,4,1,1,2,2,2],
[2,2,2,1,1,5,1,1,2,2,2],
[2,2,2,2,1,1,1,2,2,2,2],
[2,2,2,2,2,2,2,2,2,2,2],
[2,2,2,2,2,2,2,2,2,2,2]
]


];

//上下层初始位置 x1,y1飞楼或下层进入上层  x2,y2 下楼
var mapInitPosition= [
{//序章
	x1:10,
	y1:5,
	x2:1,
	y2:5
},{//一层
	x1:9,
	y1:5,
	x2:0,
	y2:1
},{//二层
	x1:1,
	y1:0,
	x2:9,
	y2:0
},{//三层
	x1:10,
	y1:1,
	x2:9,
	y2:10
},{//四层
	x1:9,
	y1:10,
	x2:9,
	y2:0
},{//五层
	x1:9,
	y1:0,
	x2:9,
	y2:9
},{//六层
	x1:9,
	y1:9,
	x2:9,
	y2:4
},{//七层
	x1:10,
	y1:5,
	x2:0,
	y2:1
},{//八层
	x1:1,
	y1:0,
	x2:4,
	y2:7
},{//九层
	x1:3,
	y1:6,
	x2:7,
	y2:6
},{//十层
	x1:6,
	y1:4,
	x2:9,
	y2:0
},{//十一层
	x1:10,
	y1:1,
	x2:10,
	y2:9
},{//十二层
	x1:10,
	y1:9,
	x2:10,
	y2:1
},{//十三层
	x1:10,
	y1:1,
	x2:10,
	y2:4
},{//十四层
	x1:9,
	y1:5,
	x2:0,
	y2:5
},{//十五层
	x1:0,
	y1:3,
	x2:0,
	y2:7
},{//十六层
	x1:0,
	y1:5,
	x2:6,
	y2:5
}

]

var tipsData = {
	"2001":"获得一把 【黄钥匙】！",
	"2002":"获得一把 【蓝钥匙】！",
	"2003":"获得一把 【红钥匙】！",
	"2007":"得到 【小血瓶】 生命加200！",
	"2008":"得到 【大血瓶】 生命加500！",
	"2009":"圣光徽|该宝物可以查看怪物的基本情况，使用时按下键盘上的【L】键便可进行查看，再次按【L】键则取消显示。",
	"2010":"获得 【蓝宝石】 防御+3！",
	"2011":"获得 【红宝石】 攻击+3！",
	"2012":"获得 【铁剑】 攻击+10！",
	"2013":"获得 【大钥匙】 各种钥匙数量+1！",
	"2014":"获得 【铁盾】 防御+10！",
	"2015":"获得 【小飞羽】 等级提升1级！",
	"2016":"获得 【大金币】 金币+300！",
	"2017":"幸运十字架|把它交给序章中的仙子，可以将自身的所有能力提升一些（攻击、防御和生命值）。",
	"2018":"风之罗盘|该宝物可以随意在已经走过的楼层间自有上下。当主角未与上行楼梯或下行楼梯时可使用【J】键在已经走过的楼层间进行跳跃."
}

//怪物属性
var monstersData = {
	//生命、攻击、防御、金币、经验 ,名称
	"3001":[50, 20, 1, 1, 1, "绿头怪",3001],
	"3002":[70, 15, 2, 2, 2, "红头怪",3002],
	"3003":[200, 35, 10, 5, 5, "青头怪",3003],
	"3004":[110, 25, 5, 5, 4, "骷髅人",3004],
	"3005":[150, 40, 20, 8, 6, "骷髅士兵",3005],
	"3006":[100, 20, 5, 3, 3, "小蝙蝠",3006,],
	"3007":[125, 50, 25, 10, 7, "初级法师",3007],
	"3008":[300, 75, 45, 13, 10, "兽面人",3008],
	"3009":[900, 750, 650, 77, 70, "金队长",3009],
	"3010":[850, 350, 200, 45, 40, "金卫士",3010],
	"3011":[150, 65, 30, 10, 8, "大蝙蝠",3011],
	"3012":[550, 160, 90, 25, 20, "红蝙蝠",3012],
	"3013":[450, 150, 90, 22, 19, "初级卫兵",3013],
	"3014":[400, 90, 50, 15, 12, "骷髅队长",3014],
	"3015":[700, 250, 125, 32, 30, "怪王",3015],
	"3016":[500, 115, 65, 15, 15, "石头怪人",3016],
	"3017":[500, 400, 260, 47, 45, "红衣法师",3017],
	"3018":[100, 200, 110, 30, 25, "高级法师",3018],
	"3019":[1300, 300, 150, 40, 35, "白衣武士",3019],
	"3020":[250, 120, 70, 20, 17, "麻衣法师",3020],
	"3021":[900, 450, 330, 50, 50, "兽面武士",3021],
	"3022":[1250, 500, 400, 55, 55, "冥卫兵",3022],
	"3023":[1500, 560, 460, 60, 60, "高级卫兵",3023],
	"3024":[1200, 620, 520, 65, 75, "双手剑士",3024],
	"3025":[2000, 680, 590, 70, 65, "冥战士",3025],
	"3026":[1200, 980, 900, 88, 75, "灵武士",3026],
	"3027":[1500, 830, 730, 80, 70, "灵法师",3027],
	"3028":[2500, 900, 850, 84, 75, "冥队长",3028],
	"3029":[15000, 1000, 1000, 100, 100, "红衣魔王",3029],
}


 
/*
生、攻、防、金、经




[3100, 1150, 1050, 92, 80, "影子战士"]

[20000, 1333, 1333, 133, 133, "红衣魔王"]
[30000, 1700, 1500, 250, 220, "冥灵魔王"]      
[45000, 2550, 2250, 312, 275, "冥灵魔王"]
[3333, 1200, 1133, 112, 100, "冥队长"]
[1800, 1306, 1200, 117, 100, "灵武士"]
[2400, 980, 900, 88, 75, "灵武士"]
[2000, 1106, 730, 106, 93, "灵法师"]
[1500, 830, 730, 132, 116, "灵法师"]
[60000, 3400, 3000, 390, 343, "冥灵魔王"]
[99999, 5000, 4000, 0, 0, "血影"]
[99999, 9999, 5000, 0, 0, "魔龙"]


*/


//无法行走的地方
var cannotgo = [
	1,2,3
];


//对话
	//层数
		//标志
			//role 角色图片编码
			//roleName：角色名称
			//text:对话内容
var towerTalking = {
	0:{//层数
		"angel":{//对话角色
			"start"://开局对话
				[
					{
						role:'hero-1',
						roleName:'勇士',
						text:'……'
					},
					{
						role:'1001',
						roleName:'仙子',
						text:'你醒了！'
					},
					{
						role:'hero-1',
						roleName:'勇士',
						text:'……|你是谁？我在哪里？'//逢|换行
					},
					{
						role:'1001',
						roleName:'仙子',
						text:'我是这里的仙子,刚才你被这里的小怪打昏了。'
					},
					{
						role:'hero-1',
						roleName:'勇士',
						text:'……|剑,剑,我的剑呢？'//逢|换行
					},
					{
						role:'1001',
						roleName:'仙子',
						text:'你的剑被他们抢走了,我只来得及将你救出来。'
					},
					{
						role:'hero-1',
						roleName:'勇士',
						text:'那,公主呢？我是来救公主的。'
					},
					{
						role:'1001',
						roleName:'仙子',
						text:'公主还在里面,你这样进去是打不过里面的小怪的。'
					},
					{
						role:'hero-1',
						roleName:'勇士',
						text:'那我怎么办,我答应了国王一定要把公主救出来的,那我现在应该怎么办呢？'
					},
					{
						role:'1001',
						roleName:'仙子',
						text:'放心,我把我的力量借给你,你就可以打赢那些小怪了。不过,你得先帮我去找一样东西,找到了再来这里找我。'
					},
					{
						role:'hero-1',
						roleName:'勇士',
						text:'找东西？找什么东西？'
					},
					{
						role:'1001',
						roleName:'仙子',
						text:'是一个十字架,中间有一颗红色的宝石。'
					},
					{
						role:'hero-1',
						roleName:'勇士',
						text:'那个东西有什么用吗？'
					},
					{
						role:'1001',
						roleName:'仙子',
						text:'我本是这座塔的守护者,可不久前,从北方来了一批恶魔,他们占领了这座塔,并将我的魔力封在了这个十字架里面,如果你能将它带出塔来,那我的魔力便会慢慢地恢复,到那时我便可以把力量借给你去救出公主了。'
					},
					{
						role:'1001',
						roleName:'仙子',
						text:'要记住：只有用我的魔力才可以打开二十一层的门。'
					},
					{
						role:'hero-1',
						roleName:'勇士',
						text:'……|好吧,我试试看。'
					},
					{
						role:'1001',
						roleName:'仙子',
						text:'刚才我去看过了,你的剑被放在三楼,你的盾在五楼上,而那个十字架被放在七楼。要到七楼,你得先取回你的剑和盾。|另外,在塔里的其他楼层上,还有一些存放了好几百年的宝剑和宝物,如果得到它们,对于你对付里面的怪物将有很大的帮助。'
					},
					{
						role:'hero-1',
						roleName:'勇士',
						text:'可是,我怎么进去呢？'
					},
					{
						role:'1001',
						roleName:'仙子',
						text:'我这里有三把钥匙,你先拿去,在它里面还有很多这样的钥匙,你一定要珍惜使用。'
					},
					{
						role:'1001',
						roleName:'仙子',
						text:'勇敢的去吧,勇士！'
					}
				],
			"comeon":
				[//等待无事发生
					{
						role:'1001',
						roleName:'仙子',
						text:'拿到十字架之后再来找我吧,十字架在七楼。'
					}
				],
			"cross":[//十字架给仙子
					{
						role:'hero-1',
						roleName:'勇士',
						text:'仙子，我已经将那个十字架找到了。'
					},{
						role:'1001',
						roleName:'仙子',
						text:'你做得很好。|那么，现在我就开始授予你更强的力量！|咪啦哆咪哗……'
					},{
						role:'1001',
						roleName:'仙子',
						text:'好了，我已经将你现在的能力提升了！'
					},{
						role:'1001',
						roleName:'仙子',
						text:'记住，如果你没有足够的实力的话，不要去第二十一层！在那一层里，你所有的宝物的法力都会失去作用！'
					}
				],
			"magicBar":[//十六层法杖 没给仙子法杖打到第16层触发16层神秘老人对话
					{
						role:'1001',
						roleName:'仙子',
						text:'嗯？！你手里的那个东西是什么？'
					},{
						role:'hero-1',
						roleName:'勇士',
						text:'这个？这是一个老人交给我的，是他叫我带它来找你的。他说你知道它的来历和作用。'
					},{
						role:'1001',
						roleName:'仙子',
						text:'这个东西是仙界的圣物“灵之杖”，是很久以前的一个圣者留下的。它们一共有三个，分别镶着红、绿、蓝三种颜色的宝石。你现在拿着的是一颗镶有蓝宝石的“冰之神杖”，应该还有一个镶有绿宝石的“心之神杖”和镶有红宝石的“炎之神杖”。在这座塔的下面，封印着一只魔界的世兽，名叫“血影”，这三把“灵之杖”就是封印的钥匙。'
					},{
						role:'hero-1',
						roleName:'勇士',
						text:'封印钥匙？'
					},{
						role:'1001',
						roleName:'仙子',
						text:'每一个“灵之杖”里面都有着很强的魔法力量，如果被恶魔得到了将会使它的力量倍增。如果被恶魔将它们找齐的话。那么“血影”的封印便会解除！勇士，你还是快去把我要的东西找来吧，等我恢复了魔力，我就可以帮你将“灵之杖”中的魔力都开放出来！'
					},
				]
			}
		},
	2:{
		"oldman":{
			"start":[//2层神秘老人
				{
					role:'hero-1',
					roleName:'勇士',
					text:'您已经得救了！'
				},{
					role:'1008',
					roleName:'神秘老人',
					text:'哦，我的孩子，真实太感谢你了！'
				},{
					role:'1008',
					roleName:'神秘老人',
					text:'这个地方又脏又破，我真的是快待不下去了。'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'快走吧，我还得去救被关在这里的公主'
				},{
					role:'1008',
					roleName:'神秘老人',
					text:'哦，你是来救公主的，为了表示对你的感谢，这个东西就送给你吧，这还是我年轻的时候用过的。'
				},{
					role:'1008',
					roleName:'神秘老人',
					text:'拿着它去解救公主吧！'
				}
			]
		},
		"businessman":{
			"start":[//2层商人
				{
					role:'hero-1',
					roleName:'勇士',
					text:'您已经得救了！'
				},{
					role:'1009',
					roleName:'商人',
					text:'哦，是嘛！真是太感谢你了！'
				},{
					role:'1009',
					roleName:'商人',
					text:'我是个商人，不知为什么被抓到这里来了。'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'快走吧，现在您已经自由了。'
				},{
					role:'1009',
					roleName:'商人',
					text:'哦，对对对，我已经自由了。'
				},{
					role:'1009',
					roleName:'商人',
					text:'那这个东西就给你吧，本来我是准备买钱的。'
				},{
					role:'1009',
					roleName:'商人',
					text:'相信它对你一定很有帮助！。'
				}
			]
		}
	},
	4:{
		"thief":{
			"start":[//4层小偷首次相遇
				{
					role:'hero-1',
					roleName:'勇士',
					text:'你已经得救了！'
				},{
					role:'1007',
					roleName:'小偷',
					text:'啊，那真是太好了，我又可以在这里面寻宝了！'
				},{
					role:'1007',
					roleName:'小偷',
					text:'哦，还没有自我介绍，我叫杰克，是这附近有名的小偷，什么金银财宝我样样都偷过。'
				},{
					role:'1007',
					roleName:'小偷',
					text:'不过这次运气可不是太好，刚进来就被抓了。'
				},{
					role:'1007',
					roleName:'小偷',
					text:'现在你帮我打开了门，那我就帮你做一件事吧。'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'快走吧，外面还有很多怪物，我可能顾不上你。'
				},{
					role:'1007',
					roleName:'小偷',
					text:'不，不，不会有事的，快说吧，叫我做什么？'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'……|你会开门吗？'
				},{
					role:'1007',
					roleName:'小偷',
					text:'那当然。'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'那就请你帮我打开第二层的门吧！'
				},{
					role:'1007',
					roleName:'小偷',
					text:'那个简单，不过，如果你能帮我找到一把嵌了红宝石的铁榔头的话，我还能帮你打通第十八层的路。'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'嵌了红宝石的铁榔头？好吧，我帮你找找。'
				},{
					role:'1007',
					roleName:'小偷',
					text:'非常的感谢。一会我便会将第二层的门打开。'
				},{
					role:'1007',
					roleName:'小偷',
					text:'如果你找到那个铁榔头的话，还是来这里找我！'
				}
			],
			"comeon":[//4层小偷等待
				{
					role:'1007',
					roleName:'小偷',
					text:'如果你找到那个铁榔头的话，还是来这里找我！'
				}
			],
			"end":[//找到榔头后的对话
				{
					role:'hero-1',
					roleName:'勇士',
					text:'哈，快看，我找到了什么！'
				},{
					role:'1007',
					roleName:'小偷',
					text:'太好了，这个东西果然是在这里。'
				},{
					role:'1007',
					roleName:'小偷',
					text:'好吧，我这就去帮你修好第十八层的路面。'
				}
			]
		}
	},
	15:{
		"oldman":{
			"start":[
				{
					role:'1008',
					roleName:'神秘老人',
					text:'好，勇敢的孩子，你终于来到这里了。我将给你一个非常好的宝物，它可以使你的攻击力提升120点，但这必须的用你的500点经验来进行交换，考虑一下子吧！'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'太可惜了，我没有足够的经验。'
				}
			],
			"end":[
				{
					role:'1008',
					roleName:'神秘老人',
					text:'好，勇敢的孩子，你终于来到这里了。我将给你一个非常好的宝物，它可以使你的攻击力提升120点，但这必须的用你的500点经验来进行交换，考虑一下子吧！'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'好吧，那就将那把剑给我吧！'
				},{
					role:'1008',
					roleName:'神秘老人',
					text:'那好吧，这把剑就给你了！'
				}
			]
		},
		"businessman":{
			"start":[
				{
					role:'1009',
					roleName:'商人',
					text:'啊哈，欢迎你的到来！我这里有一件对你来说非常好的宝物，只要你出得起钱，我就卖给你。'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'什么宝物？要多少钱？'
				},{
					role:'1009',
					roleName:'商人',
					text:'是这个游戏是最好的盾牌，防御值可以增加120点，而你只要出500个金币就可以买下。怎么样？你有500个金币吗？'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'太可惜了，我没有那么多金币。'
				}
			],
			"end":[
				{
					role:'1009',
					roleName:'商人',
					text:'啊哈，欢迎你的到来！我这里有一件对你来说非常好的宝物，只要你出得起钱，我就卖给你。'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'什么宝物？要多少钱？'
				},{
					role:'1009',
					roleName:'商人',
					text:'是这个游戏是最好的盾牌，防御值可以增加120点，而你只要出500个金币就可以买下。怎么样？你有500个金币吗？'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'我有500个金币。'
				},{
					role:'1009',
					roleName:'商人',
					text:'好，成交!'
				}
			]
		}
	},
	16:{
		"oldman":{
			"start":[
				{
					role:'1008',
					roleName:'神秘老人',
					text:'年轻人，你终于来了！'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'您怎么了？'
				},{
					role:'1008',
					roleName:'神秘老人',
					text:'我已经快封不住它了，请你将这个东西交给彩蝶仙子，她会告诉你这是什么东西，有什么用的！快去吧，再迟就来不及了！'
				}
			]
		},
		"monster":{
			"start":[
				{
					role:'hero-1',
					roleName:'勇士',
					text:'……'
				},{
					role:'1010',
					roleName:'红衣魔王',
					text:'停止吧！愚蠢的人类！'
				},{
					role:'hero-1',
					roleName:'勇士',
					text:'该停止的是你！魔王。快说，公主关在哪里？'
				},{
					role:'1010',
					roleName:'红衣魔王',
					text:'等你打赢我再说吧！'
				}
			]
		}
	}
}

//商店设置
var shopSetting= {
	gold3:{//3层金币商店
		text:{
			caption:'想要增加你的能力吗？如果你有 25 个金币，你可以任意选择一项：',
			item1:'增加 800 点生命',
			item2:'增加 4 点攻击',
			item3:'增加 4 点防御',
			leave:'离开商店'
		},
		control:{
			item1:{
				condition:'gold',
				cnumber:25,
				result:[
					{
						item:'life',
						rnumber:800
					}
				]
				
			},
			item2:{
				condition:'gold',
				cnumber:25,
				result:[
					{
						item:'attack',
						rnumber:4
					}
				]
			},
			item3:{
				condition:'gold',
				cnumber:25,
				result:[
					{
						item:'defence',
						rnumber:4
					}
				]
			}
		}
	},
	gold11:{//11层金币商店
		text:{
			caption:'想要增加你的能力吗？如果你有 100 个金币，你可以任意选择一项：',
			item1:'增加 4000 点生命',
			item2:'增加 20 点攻击',
			item3:'增加 20 点防御',
			leave:'离开商店'
		},
		control:{
			item1:{
				condition:'gold',
				cnumber:100,
				result:[
					{
						item:'life',
						rnumber:4000
					}
				]
				
			},
			item2:{
				condition:'gold',
				cnumber:100,
				result:[
					{
						item:'attack',
						rnumber:20
					}
				]
			},
			item3:{
				condition:'gold',
				cnumber:100,
				result:[
					{
						item:'defence',
						rnumber:20
					}
				]
			}
		}
	},
	exp5:{//5层经验商店
		text:{
			caption:'你好，英雄的人类，只要你有足够的经验，我就可以让你变的更强大：',
			item1:'提升一级（需要 100 点）',
			item2:'增加攻击（需要 30 点）',
			item3:'增加防御（需要 30 点）',
			leave:'离开商店'
		},
		control:{
			item1:{//提升一级：+7攻击+7防御+1000HP
				condition:'exp',
				cnumber:100,
				result:[
					{
						item:'level',
						rnumber:1
					},{
						item:'attack',
						rnumber:7
					},{
						item:'defence',
						rnumber:7
					},{
						item:'life',
						rnumber:1000
					}
				]
			},
			item2:{
				condition:'exp',
				cnumber:30,
				result:[
					{
						item:'attack',
						rnumber:5
					}
				]
			},
			item3:{
				condition:'exp',
				cnumber:30,
				result:[
					{
						item:'defence',
						rnumber:5
					}
				]
			}
		}
	},
	exp13:{//13层经验商店
		text:{
			caption:'你好，英雄的人类，只要你有足够的经验，我就可以让你变的更强大：',
			item1:'提升三级（需要 270 点）',
			item2:'增加攻击 17 （需要 95 点）',
			item3:'增加防御 17 （需要 95 点）',
			leave:'离开商店'
		},
		control:{
			item1:{//提升三级：+21攻击+21防御+3000HP
				condition:'exp',
				cnumber:270,
				result:[
					{
						item:'level',
						rnumber:3
					},{
						item:'attack',
						rnumber:21
					},{
						item:'defence',
						rnumber:21
					},{
						item:'life',
						rnumber:3000
					}
				]
			},
			item2:{
				condition:'exp',
				cnumber:95,
				result:[
					{
						item:'attack',
						rnumber:17
					}
				]
			},
			item3:{
				condition:'exp',
				cnumber:95,
				result:[
					{
						item:'defence',
						rnumber:17
					}
				]
			}
		}
	},
	keys5:{//5层钥匙商店
		text:{
			caption:'相信你一定有特殊的需要，只要你有金币，我就可以帮你：',
			item1:'购买 1 把 黄钥匙（$ 10）',
			item2:'购买 1 把 蓝钥匙（$ 50）',
			item3:'购买 1 把 红钥匙（$ 100）',
			leave:'离开商店'
		},
		control:{
			item1:{
				condition:'gold',
				cnumber:10,
				result:[
					{
						item:'yellowKey',
						rnumber:1
					}
				]
			},
			item2:{
				condition:'gold',
				cnumber:50,
				result:[
					{
						item:'blueKey',
						rnumber:1
					}
				]
			},
			item3:{
				condition:'gold',
				cnumber:100,
				result:[
					{
						item:'redKey',
						rnumber:1
					}
				]
			}
		}
		
	},keys12:{//12层钥匙商店卖出钥匙
		text:{
			caption:'哦，欢迎你的到来，如果你手里缺少金币，我可以帮你：',
			item1:'卖出 1 把 黄钥匙（$ 7）',
			item2:'卖出 1 把 蓝钥匙（$ 35）',
			item3:'卖出 1 把 红钥匙（$ 70）',
			leave:'离开商店'
		},
		control:{
			item1:{
				condition:'yellowKey',
				cnumber:1,
				result:[
					{
						item:'gold',
						rnumber:7
					}
				]
			},
			item2:{
				condition:'blueKey',
				cnumber:1,
				result:[
					{
						item:'gold',
						rnumber:35
					}
				]
			},
			item3:{
				condition:'redKey',
				cnumber:1,
				result:[
					{
						item:'gold',
						rnumber:70
					}
				]
			}
		}
		
	}
	
}


